node {
  name: "x_pl"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "y_pl"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "test_model/model/images/resize_images/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\001\000\000\000\002\000\000"
      }
    }
  }
}
node {
  name: "test_model/model/images/resize_images/ResizeBilinear"
  op: "ResizeBilinear"
  input: "x_pl"
  input: "test_model/model/images/resize_images/size"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "test_model/model/images/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\003\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "test_model/model/images/transpose"
  op: "Transpose"
  input: "test_model/model/images/resize_images/ResizeBilinear"
  input: "test_model/model/images/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "test_model/model/images/sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 128.0
      }
    }
  }
}
node {
  name: "test_model/model/images/sub"
  op: "Sub"
  input: "test_model/model/images/transpose"
  input: "test_model/model/images/sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "test_model/model/images/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 128.0
      }
    }
  }
}
node {
  name: "test_model/model/images/truediv"
  op: "RealDiv"
  input: "test_model/model/images/sub"
  input: "test_model/model/images/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\003\000\000\000\r\000\000\000"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1154700517654419
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/TruncatedNormal"
  input: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal"
  op: "Add"
  input: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/mul"
  input: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 3
        }
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/downsample/conv/weights/w"
  input: "model/encoder/downsample1/downsample/conv/weights/w/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/weights/w/read"
  op: "Identity"
  input: "model/encoder/downsample1/downsample/conv/weights/w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/weights/w"
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/conv/convolution/Conv2D"
  op: "Conv2D"
  input: "test_model/model/images/truediv"
  input: "model/encoder/downsample1/downsample/conv/weights/w/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 2
        i: 2
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/Initializer/ones/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 13
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/Initializer/ones/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/Initializer/ones"
  op: "Fill"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/Initializer/ones/shape_as_tensor"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/Initializer/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/read"
  op: "Identity"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 13
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/Initializer/zeros"
  op: "Fill"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/Initializer/zeros/shape_as_tensor"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/read"
  op: "Identity"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 13
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/Initializer/zeros"
  op: "Fill"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/Initializer/zeros/shape_as_tensor"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/Initializer/ones/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 13
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/Initializer/ones/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/Initializer/ones"
  op: "Fill"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/Initializer/ones/shape_as_tensor"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/Initializer/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "test_model/model/encoder/downsample1/downsample/conv/convolution/Conv2D"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/gamma/read"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/beta/read"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_mean/read"
  input: "model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05000000074505806
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/conv/relu/LeakyRelu/alpha"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/conv/relu/LeakyRelu/mul"
  op: "Mul"
  input: "test_model/model/encoder/downsample1/downsample/conv/relu/LeakyRelu/alpha"
  input: "test_model/model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/conv/relu/LeakyRelu/Maximum"
  op: "Maximum"
  input: "test_model/model/encoder/downsample1/downsample/conv/relu/LeakyRelu/mul"
  input: "test_model/model/encoder/downsample1/downsample/conv/batchnorm/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/pool/MaxPool"
  op: "MaxPool"
  input: "test_model/model/images/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 1
        i: 2
        i: 2
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 2
        i: 2
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/concat/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/downsample/concat/concat"
  op: "ConcatV2"
  input: "test_model/model/encoder/downsample1/downsample/conv/relu/LeakyRelu/Maximum"
  input: "test_model/model/encoder/downsample1/downsample/pool/MaxPool"
  input: "test_model/model/encoder/downsample1/downsample/concat/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\001\000\000\000\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.14433756470680237
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/TruncatedNormal"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal"
  op: "Add"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/mul"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/read"
  op: "Identity"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w"
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/convolution/Conv2D"
  op: "Conv2D"
  input: "test_model/model/encoder/downsample1/downsample/concat/concat"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/weights/w/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\003\000\000\000\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.14433756470680237
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/TruncatedNormal"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal"
  op: "Add"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/mul"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/read"
  op: "Identity"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w"
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/convolution/Conv2D"
  op: "Conv2D"
  input: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/horiz/convolution/Conv2D"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/weights/w/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/relu/LeakyRelu/alpha"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/relu/LeakyRelu/mul"
  op: "Mul"
  input: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/relu/LeakyRelu/alpha"
  input: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/convolution/Conv2D"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/relu/LeakyRelu/Maximum"
  op: "Maximum"
  input: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/relu/LeakyRelu/mul"
  input: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/convolution/Conv2D"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\001\000\000\000\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.14433756470680237
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/TruncatedNormal"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal"
  op: "Add"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/mul"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/read"
  op: "Identity"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w"
      }
    }
  }
}
node {
  name: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/convolution/Conv2D"
  op: "Conv2D"
  input: "test_model/model/encoder/downsample1/non-bt-1/non_bt/asym1/vert/relu/LeakyRelu/Maximum"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/horiz/weights/w/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\003\000\000\000\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.14433756470680237
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/TruncatedNormal"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal"
  op: "Add"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/mul"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Assign"
  op: "Assign"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w/read"
  op: "Identity"
  input: "model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@model/encoder/downsample1/non-bt-1/non_bt/asym2/vert/weights/w"
      }
    }
  }
